API_TOKEN = '1190330548:AAG7iOayNNGioXikyHYiWf4PtW8iRqS7wx0'

TIME_PARSING=300



WELCOM_TEXT='''
Здравствуйте, Вас приветствует \n
Бот для отслеживания новых объявлений на Авито
'''

HELP_TEXT='''
Перед запуском мониторинга свежих объявлений необходимо\n 
добавить ссылку на страницу Avito \n\n
Для этого перейдите на сайт https://www.avito.ru/ \n
и установите необходимые критерии поиска, \n
а также выберите сортировку объявлений – по дате\n\n
После этого скопируйте ссылку из адресной строки браузера, \n
перейдите в настройки и добавьте вашу ссылку\n\n
Также в настройках вы можете установить временной интервал, \n
во время которого вам будут приходить сообщения о новых объявлениях\n\n
Для запуска мониторинга свежих объявлений, перейдите в \n
меню – управление и выберите –Старт\n
Для остановки мониторинга: кнопка - Стоп\n\n


'''

SETTINGS_TEXT = '''

Настройки работы с ботом:\n
Нажмите нужную кнопку


'''

ADD_LINK_TEXT='''
скопируйте ссылку из адресной строки браузера с сайта Avito ,\n и отправьте ее боту

'''


ADD_TIME_TEXT='''
Данный параметр позволяет ограничить временной интервал\n
получения вами сообщений от бота о появлении свежих объявлений\n
Используется привязка к Московскому времени\n
Нажмите – Установить время\n

'''

SET_TIME_TEXT='''
Введите ограничение по времени в формате: от-до

НАПРИМЕР:
8-20
для получения сообщений с 8 до 20 часов по Москве

или
0-24

для клуглосуточного мониторинга

'''


WRITE_LINK_TEXT='Ссылка успешно добавлена\nперейдите в -Управление-\nи запустите мониторинг'

BAD_LINK_TEXT='Введите правильную ссылку'

BAD_ADD_LINK='Ошибка добавления ссылки'



WRITE_TIME_TEXT='временные параметры мониторинга установлены'

BAD_WRITE_TIME_TEXT='введите правильное время'

START_MONITOR_TEXT='Мониторинг включен'


STOP_MONITOR_TEXT='Мониторинг выключен'

CONTOL_MONITOR_TEXT='Меню управления мониторингом'


NO_LINK_TEXT='Для запуска мониторинга,\n добавьте ссылку в настройках'

BACK_TEXT='Панель управления ботом'